#include <clocale>
#include <iostream>
#include <cmath>
#include <string>


using namespace std;


int main() {
	setlocale(LC_ALL, "Russian");
	int a, b;
	string months[13] = {
		" ", "января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"
	};
	string days[32] = {
		" ", "первое", "второе", "третье", "четвертое", "пятое", "шестое", "седьмое", "восьмое", "девятое", "десятое", "одиннадцатое", "двенадцатое", "тринадцатое", "четырнадцатое", "пятнадцатое", "шестнадцатое", "семнадцатое", "восемнадцатое", "девятнадцатое", "двадцатое", "двадцать первое", "двадцать второе", "двадцать третье", "двадцать четвертое", "двадцать пятое", "двадцать шестое", "двадцать седьмое", "двадцать восьмое", "двадцать девятое", "тридцатое", "тридцать первое"
	};
	cout << "Введите номер дня и месяца: ";
	cin >> a >> b;
	cout << days[a] << " " << months[b] << endl;


	int n;
	char c;
    cout << "Направление: ";
    cin >> c;
    cout << "Команда: ";
    cin >> n;
    switch (c) {
    case 'С':
        switch (n) {
        case 1:
            c = 'З';
            break;
        case 0:
            c = 'С';
            break;
        case -1:
            c = 'В';
            break;
        }
        break;
    case 'В':
        switch (n) {
        case 1:
            c = 'С';
            break;
        case 0:
            c = 'В';
            break;
        case -1:
            c = 'Ю';
            break;
        }
    case 'Ю':
        switch (n) {
        case 1:
            c = 'В';
            break;
        case 0:
            c = 'Ю';
            break;
        case -1:
            c = 'З';
            break;
        }
        break;
    case 'З':
        switch (n) {
        case 1:
            c = 'Ю';
            break;
        case 0:
            c = 'З';
            break;
        case -1:
            c = 'С';
            break;
        }
    }
    cout << c << endl;


    cout << "Введите кол-во заданий: ";
    cin >> n;
    string num[41]{
        " "," ", " ", " "," ", " ", " "," ", " ", " ", "десять", "одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнцадцать", "девятнадцать", "двадцать", "двадцать одно", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать одно", "тридцать два", "тридцать три", "тридцать четыре", "тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок"
    };
    if (n%10==0 or n<21) {
        cout << num[n] << " учебных заданий" << endl;
    }
    else if (n > 11 and n % 10 == 1) {
        cout << num[n] << " учебное задание" << endl;
    }
    else {
        cout << num[n] << " учебных  задания" << endl;
    }
    cout << "Введите число: ";
    cin >> n;
    string sot[10] = {
        " ", "сто", "двести", "триста", "четыреста", "пятьсот", "шестьсот", "семьсот", "восемьсот", "девятьсот"
    };
    string des[10] = {
         "десять", "одиннадцать", "двенадцать", "тринадцать", "четрынадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", "девятнадцать"
    };
    string dess[10] = {
        " ", " ", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"
    };
    string ed[10] = {
        " ", "один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"
    };
    if (n % 10 == 0 and n % 100 / 10 == 0) {
        cout << sot[n / 100] << endl;
    }
    else if (n % 100 / 10 == 1) {
        cout << sot[n / 100] << " " << des[n % 10] << endl;
    }
    else if (n % 100 / 10 == 0 and n % 10 != 0) {
        cout << sot[n / 100] << " " << ed[n % 10] << endl;
    }
    else if ((n % 100 / 10 != 0 and n % 100 / 10 != 1) and n % 10 == 0) {
        cout << sot[n / 100] << " " << dess[n % 100 / 10] << endl;
    }
    else {
        cout << sot[n / 100] << " " << dess[n % 100 / 10] << " " << ed[n % 10] << endl;
    }


    cout << "Введите год ";
    int year, color, animal;
    cin >> year;
    year = year - (-56);
    while (year >= 60) year = year - 60;
    color = trunc(year / 12);
    animal = year % 12;
    cout << "Год ";
    if (animal == 2 or animal == 3 or animal == 4)
    {
        switch (color)
        {
        case(0):cout << "зелёного "; break;
        case(1):cout << "красного "; break;
        case(2):cout << "желтого "; break;
        case(3):cout << "белого "; break;
        case(4):cout << "чёрного "; break;
        }
        switch (animal)
        {
        case(2):cout << "тигра"; break;
        case(3):cout << "зайца"; break;
        case(4):cout << "дракона"; break;
        }
    }
    else
    {
        switch (color)
        {
        case(0):cout << "зелёной "; break;
        case(1):cout << "красной "; break;
        case(2):cout << "жёлтой "; break;
        case(3):cout << "белой "; break;
        case(4):cout << "чёрной "; break;
        }
        switch (animal)
        {
        case(0):cout << "крысы"; break;
        case(1):cout << "коровы"; break;
        case(5):cout << "змеи"; break;
        case(6):cout << "лошади"; break;
        case(7):cout << "овцы"; break;
        case(8):cout << "обезьяны"; break;
        case(9):cout << "курицы"; break;
        case(10):cout << "собаки"; break;
        case(11):cout << "свиньи"; break;
        }
    }
	return 0;
}